## ukol-10: Zaměstnanci a Projekty
Úkol můžeš odevzdat buďto jako Jupyter Notebook .ipynb, nebo jako klasický program .py.

### Zadání 1
Uvažuj, že zpracováváš analýzu pro softwarovou firmu. Firma má kanceláře v Praze, Plzni a Liberci. Seznam zaměstnanců pro jednotlivé kanceláře najdeš v souborech zam_praha.csv, zam_plzeň.csv a zam_liberec.csv.

Načti data o zaměstnancích z CSV souborů do tabulek (DataFrame). Ke každé tabulce přidej nový sloupec mesto, které bude obsahovat informaci o tom, ve kterém městě zaměstnanec pracuje.

In [30]:
import pandas

zam_praha = pandas.read_csv("zam_praha.csv")
zam_praha["mesto"] = "Praha"
zam_praha.head()

      jmeno prijimeni   telefonni_cislo  cislo_zamestnance  mesto
0     Brian      Hall  +421 949 656 098                 30  Praha
1     Marta  Kolářová       730 456 163                 32  Praha
2      John   Moravec       725 092 179                 33  Praha
3  Dominika   Kopecká       722 747 626                 34  Praha
4    Marcel     Hájek  +421 902 928 669                 35  Praha

In [31]:
zam_plzen = pandas.read_csv("zam_plzen.csv")
zam_plzen["mesto"] = "Plzeň"
zam_plzen.head()

      jmeno    prijimeni   telefonni_cislo  cislo_zamestnance  mesto
0     Stacy  Pospíšilová       727 293 880                  3  Plzeň
1     Matěj         Král       770 787 377                  6  Plzeň
2    Amanda       Wilson  +421 52 656 7231                  7  Plzeň
3     Angel       Wilson  +421 52 135 2491                  8  Plzeň
4  Jindřich       Howell  +421 39 043 0948                 10  Plzeň

In [32]:
zam_liberec = pandas.read_csv("zam_liberec.csv")
zam_liberec["mesto"] = "Liberec"
zam_liberec.head()

       jmeno    prijimeni   telefonni_cislo  cislo_zamestnance    mesto
0       Nela      Šťastná       728 454 176                 83  Liberec
1    Heather      Marková       604 404 522                 84  Liberec
2     Krista  Procházková  +421 50 444 5544                 85  Liberec
3   Jennifer        Brown       775 545 190                 86  Liberec
4  Ladislava    Blackwell  +421 913 487 200                 87  Liberec

Vytvoř novou tabulku zamestnanci a ulož do ní informace o všech zaměstnancích (operace concat).

In [33]:
zamestnanci = pandas.concat([zam_praha, zam_plzen, zam_liberec], ignore_index=True)
zamestnanci.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 56 entries, 0 to 55
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   jmeno              56 non-null     object
 1   prijimeni          56 non-null     object
 2   telefonni_cislo    56 non-null     object
 3   cislo_zamestnance  56 non-null     int64
 4   mesto              56 non-null     object
dtypes: int64(1), object(4)
memory usage: 2.3+ KB

Ze souboru platy_2021_02.csv načti platy zaměstnanců za únor 2021. Propoj tabulku (operace join) s platy a tabulku se zaměstnanci pomocí sloupce cislo_zamestnance.

In [34]:
platy = pandas.read_csv("platy_2021_02.csv")
platy.head()

   cislo_zamestnance     plat
0                  3  54900.0
1                  6  54800.0
2                  7  36400.0
3                  8  47900.0
4                 16  34200.0

In [35]:
zamestnanci = pandas.merge(zamestnanci, platy, on="cislo_zamestnance")
zamestnanci.head()

      jmeno  prijimeni   telefonni_cislo  cislo_zamestnance  mesto     plat
0     Brian       Hall  +421 949 656 098                 30  Praha  33500.0
1     Marta   Kolářová       730 456 163                 32  Praha  53000.0
2      John    Moravec       725 092 179                 33  Praha  38400.0
3  Dominika    Kopecká       722 747 626                 34  Praha  36800.0
4    Milada  Hernandez       773 373 704                 38  Praha  32600.0

Porovnej rozměry tabulek před spojením a po spojení. Pokud nemá některý zaměstnanec plat za únor, znamená to, že v naší firmě již nepracuje.

In [36]:
zamestnanci.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 43 entries, 0 to 42
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   jmeno              43 non-null     object
 1   prijimeni          43 non-null     object
 2   telefonni_cislo    43 non-null     object
 3   cislo_zamestnance  43 non-null     int64
 4   mesto              43 non-null     object
 5   plat               43 non-null     float64
dtypes: float64(1), int64(1), object(4)
memory usage: 2.1+ KB

Po sloučení chybí 13 řádků, čili pro 13 zaměstnanců není evidována mzda -> odešli z firmy.

Spočti průměrný plat zaměstnanců v jednotlivých kancelářích.

In [37]:
prumerny_plat_praha = zamestnanci[zamestnanci["mesto"] == "Praha"]["plat"].mean()
prumerny_plat_praha.round(1)

43295.2

In [38]:
prumerny_plat_plzen = zamestnanci[zamestnanci["mesto"] == "Plzeň"]["plat"].mean().round(2)
prumerny_plat_plzen

44792.86

In [39]:
mzdy_liberec = zamestnanci[zamestnanci["mesto"] == "Liberec"]["plat"]
prumerny_plat_liberec = mzdy_liberec.sum() / mzdy_liberec.__len__()
prumerny_plat_liberec.round()

43775.0


### Zadání 2
Pokračuj ve své práci pro softwarovou firmu. Ze souboru vykazy.csv načti informace o výkazech na projekty pro jednoho vybraného zákazníka.

Načti data ze souboru a ulož je do tabulky.

In [40]:
vykazy = pandas.read_csv("vykazy.csv")
vykazy.head()

         date  hours project  emloyee_id
0  2021-02-01    2.5     F30          13
1  2021-02-01    3.4     W05          70
2  2021-02-01    2.1     JL9          72
3  2021-02-01    5.2     F30           3
4  2021-02-01    2.4     TE1          54

Proveď agregaci a zjisti celkový počet vykázaných hodin za jednotlivé projekty.

In [41]:
vykazy.groupby("project")["hours"].sum()

project
F30    21.5
JL9     2.1
TE1    16.0
W05    30.5
YLI    31.0
Name: hours, dtype: float64

### Nepovinný bonus 1
Ulož do proměnné počet zaměstnanců, kteří v naší firmě již nepracují.
V rámci úspory se IT oddělení rozhodlo prověřit licence přidělené zaměstnancům, kteří ve firmě již nepracují. Vytvoř samostatnou tabulku, která obsahuje jména zaměstnanců, kteří ve firmě již nepracují. Tabulku ulož do souboru CSV.

### Nepovinný bonus 2
Propoj tabulku s výkazy s tabulkou se zaměstnanci, kterou jsi vytvořil(a) v předchozím cvičení.

Následně proveď statistiku vykázaných hodin za jednotlivé kanceláře, tj. spočítej celkový počet hodin vykázaný zaměstnanci jednotlivých kanceláří na projekty daného zákazníka.